<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"b9f162f87a7702e1a27a12145c8eaaae001b2af7b1689d13a9c12a3dfe240742","plan_job_ref":"Job Test actions using target and replace #450 at https://github.com/dflook/terraform-github-actions/actions/runs/12751825810","plan_out_hash":"da84c8b756748c4b1b57e09cfb5e58be2758d1d998627f56d365b30ddad0dd98","plan_hash":"5d042b2e338ec77a0f9d5c6b76a0691d044ca74f10735405334e85f34577a56b","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "AHhwGoJjdX" -> (known after apply)
!~  foreach = "WZVcYoTlKk" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #450](https://github.com/dflook/terraform-github-actions/actions/runs/12751825810)